class ProfessorWeek::Volunteer < ApplicationRecord
  audited
  enum gender: { other: 0, male: 1, female: 2 }

  def full_name
    surname.to_s + ' ' + name.to_s
  end

  def faculty
    #TODO: Don't use duplicated code
    case self.school
    when "Τμήμα Θεολογίας","Τμήμα Ποιμαντικής και Κοινωνικής Θεολογίας"
      "Σχολή Θεολογίας"
    when "Τμήμα Φιλολογίας","Τμήμα Ιστορίας και Αρχαιολογίας","Τμήμα Φιλοσοφίας και Παιδαγωγικής",
        "Τμήμα Ψυχολογίας","Τμήμα Αγγλικής Γλώσσας και Φιλολογίας","Τμήμα Γαλλικής Γλώσσας και Φιλολογίας",
        "Τμήμα Γερμανικής Γλώσσας και Φιλολογίας","Τμήμα Ιταλικής Γλώσσας και Φιλολογίας"
      "Φιλοσοφική Σχολή"
    when "Τμήμα Μαθηματικών","Τμήμα Φυσικής","Τμήμα Χημείας","Τμήμα Βιολογίας","Τμήμα Γεωλογίας",
        "Τμήμα Πληροφορικής"
      "Σχολή Θετικών Επιστημών"
    when "Τμήμα Νομικής"
      "Νομική Σχολή"
    when "Τμήμα Οικονομικών Επιστημών","Τμήμα Πολιτικών Επιστημών",
        "Τμήμα Δημοσιογραφίας και Μέσων Μαζικής Επικοινωνίας"
      "Σχολή Οικονομικών και Πολιτικών Επιστημών"
    when "Τμήμα Ιατρικής","Τμήμα Κτηνιατρικής","Τμήμα Οδοντιατρικής","Τμήμα Φαρμακευτικής"
      "Σχολή Επιστημών Υγείας"
    when "Τμήμα Πολιτικών Μηχανικών","Τμήμα Αρχιτεκτόνων","Τμήμα Αγρονόμων και Τοπογράφων Μηχανικών",
        "Τμήμα Μηχανολόγων Μηχανικών","Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών",
        "Τμήμα Χημικών Μηχανικών","Τμήμα Μηχανικών Χωροταξίας και Ανάπτυξης"
      "Πολυτεχνική Σχολή"
    when "Τμήμα Εικαστικών και Εφαρμοσμένων Τεχνών","Τμήμα Μουσικών Σπουδών","Τμήμα Θεάτρου","Τμήμα Κινηματογράφου"
      "Σχολή Καλών Τεχνών"
    when "Τμήμα Επιστημών Προσχολικής Αγωγής και Εκπαίδευσης","Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης"
      "Παιδαγωγική Σχολή"
    when "Τμήμα Επιστήμης Φυσικής Αγωγής και Αθλητισμού","Τμήμα Επιστήμης Φυσικής Αγωγής και Αθλητισμού Σερρών"
      "Σχολή Επιστήμης Φυσικής Αγωγής και Αθλητισμού"
    when "Τμήμα Γεωπονίας","Τμήμα Δασολογίας και Φυσικού Περιβάλλοντος"
      "Σχολή Γεωπονίας, Δασολογίας και Φυσικού Περιβάλλοντος"
    else
      self.school
    end


  end
end
